# Delete and Insert data

## Insert

In [1]:
import pandas as pd

In [2]:
df_1 = pd.DataFrame({
    "A": [1,2,3,4,5],
    "B": [9,8,7,6,5]
})
df_1

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [3]:
df_1.insert(1, "new_column", [0,2,4,6,8]) # insert function: (<index>, <name of coumn>, <value: ex: list, ...>)
df_1

   A  new_column  B
0  1           0  9
1  2           2  8
2  3           4  7
3  4           6  6
4  5           8  5

In [4]:
df_1.insert(2, "new_column_1", [0,2,4,6,8, 10]) 
# insert function: (<index>, <name of coumn>, <value: ex: list, ...>), length of values must match structure
df_1

ValueError: Length of values (6) does not match length of index (5)

In [6]:
df_1["new_column_1"] = df_1["A"][:3] # insert new column, values is column a but get 3 element from the first
df_1

   A  new_column  B  new_column_1
0  1           0  9           1.0
1  2           2  8           2.0
2  3           4  7           3.0
3  4           6  6           NaN
4  5           8  5           NaN

## Delete

In [7]:
df_1

   A  new_column  B  new_column_1
0  1           0  9           1.0
1  2           2  8           2.0
2  3           4  7           3.0
3  4           6  6           NaN
4  5           8  5           NaN

In [8]:
df_1.pop("new_column") # get column values and then remove this column from data frame

0    0
1    2
2    4
3    6
4    8
Name: new_column, dtype: int64

In [9]:
df_1

   A  B  new_column_1
0  1  9           1.0
1  2  8           2.0
2  3  7           3.0
3  4  6           NaN
4  5  5           NaN

In [10]:
del df_1["new_column_1"] # delete directly column and not return column values
df_1

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5